Охотники_и_рыболовы/src/DataProcessors/КорректировкаДанныхОхотников/КорректировкаДанныхОхотников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КорректировкаДанныхОхотников</name>
</mdclass:DataProcessor>

Охотники_и_рыболовы/src/InformationRegisters/ОхотничьиБилеты/ОхотничьиБилеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОхотничьиБилеты</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗарегистрированВ</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
      <types>CatalogRef.ОрганыВыдачиГосБилетов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КемВыдан</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаЛишения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияЛишения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Причина</name>
    <type>
      <types>EnumRef.ПричиныНедействительностиБилета</types>
    </type>
  </attributes>
  <dimensions>
    <name>Охотник</name>
    <type>
      <types>CatalogRef.Охотники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидБилета</name>
    <type>
      <types>EnumRef.ВидыОхотничьихБилетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лишен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Охотники_и_рыболовы/src/Enums/ВидыОхотничьихБилетов/ВидыОхотничьихБилетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОхотничьихБилетов</name>
  <enumValues>
    <name>ГосБилет</name>
    <comment>Охотничий билет Российской Федерации</comment>
  </enumValues>
  <enumValues>
    <name>ЧленскийБилет</name>
    <comment>Членский охотничье-рыболовный билет</comment>
  </enumValues>
</mdclass:Enum>

Охотники_и_рыболовы/src/DataProcessors/КорректировкаДанныхОхотников/Forms/Форма/Module.bsl
&НаКлиенте
Процедура НайтиНекорректных(Команда)
	НайтиНаСервере();
КонецПроцедуры

Процедура НайтиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОхотничьиБилеты.Охотник КАК Охотник,
	|	ОхотничьиБилеты.Охотник.ЧленОООР КАК ЧленОООР,
	|	ОхотничьиБилеты.Серия,
	|	ОхотничьиБилеты.Номер,
	|	ОхотничьиБилеты.ЗарегистрированВ,
	|	ОхотничьиБилеты.КемВыдан
	|ИЗ
	|	РегистрСведений.ОхотничьиБилеты.СрезПоследних(
	|			,
	|			НЕ Охотник.ЧленОООР
	|				И ВидБилета = ЗНАЧЕНИЕ(Перечисление.ВидыОхотничьихБилетов.ЧленскийБилет)
	|				И Действует) КАК ОхотничьиБилеты";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Все данные охотников корректны");
		Возврат;
	КонецЕсли;	
	
	ТабНекорректные = РеквизитФормыВЗначение("НекорректныеДанные");
	ТабНекорректные.Очистить();
	ТабНекорректные = Результат.Выгрузить();
	ЗначениеВРеквизитФормы(ТабНекорректные,"НекорректныеДанные");
	
КонецПроцедуры	

&НаКлиенте
Процедура Скорректировать(Команда)
	СкорректироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СкорректироватьНаСервере()
	
	КоличествоЭлементов = НекорректныеДанные.Количество();
	
	Итераций = Цел(КоличествоЭлементов / 1000) + 1;
	
	ТабНекорректные = РеквизитФормыВЗначение("НекорректныеДанные");
	
	ТекущаяТаблица = ТабНекорректные.СкопироватьКолонки("Охотник");
	
	ПолучитьТысячу = Ложь;
	
	инд = 1;
	
	Для шаг = 1 по Итераций Цикл
		НачатьТранзакцию();
		
		Если шаг <> Итераций Тогда
			ПолучитьТысячу = Истина;
		КонецЕсли;
		
		ТекущаяТаблица.Очистить();
		
		Пока инд <= КоличествоЭлементов Цикл
			
			ЗаполнитьЗначенияСвойств(ТекущаяТаблица.Добавить(),ТабНекорректные[инд - 1]);
			
			Если ПолучитьТысячу 
				И Цел(инд /1000) = инд / 1000 Тогда	
				инд = инд + 1;	
				Прервать;
			КонецЕсли;	
							
			инд = инд + 1;	
		КонецЦикла;		
			
		Блокировка = Новый БлокировкаДанных;
		ЭлБлок = Блокировка.Добавить("Справочник.Охотники");
		ЭлБлок.Режим = РежимБлокировкиДанных.Исключительный;
		элБлок.ИсточникДанных = ТекущаяТаблица;
		элБлок.ИспользоватьИзИсточникаДанных("Ссылка","Охотник");
		Попытка
			Блокировка.Заблокировать();
		Исключение
			Продолжить;	
		КонецПопытки;
			
		Для каждого элОхотника Из ТекущаяТаблица Цикл
			ОбъектОхотник = элОхотника.Охотник.ПолучитьОбъект();
			Попытка
				ОбъектОхотник.ОбменДанными.Загрузка = Истина;
				ОбъектОхотник.Записать();
			Исключение
				Продолжить;
			КонецПопытки;
			
		КонецЦикла;	
		
		ЗафиксироватьТранзакцию();	
	КонецЦикла;	
	
	НайтиНаСервере();
	
КонецПроцедуры
